; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c6-s4-p18-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 c4 c5 
          t0 t1 t2 t3 t4 t5 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 l3-0 l3-1 l3-2 l3-3 l4-0 l4-1 l4-2 l4-3 l5-0 l5-1 l5-2 l5-3 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l5-3)
    (in-city  l5-3 c5)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (at t0 l0-3)
    (at t1 l1-0)
    (at t2 l2-2)
    (at t3 l3-1)
    (at t4 l4-2)
    (at t5 l5-1)
    (at p0 l5-3)
    (at p1 l5-3)
    (at p2 l5-1)
    (at p3 l0-1)
    (at p4 l2-1)
    (at p5 l0-2)
    (at p6 l5-0)
    (at p7 l0-0)
    (at p8 l1-1)
    (at p9 l4-0)
    (at p10 l4-3)
    (at p11 l4-2)
    (at p12 l3-3)
    (at p13 l3-0)
    (at p14 l2-1)
    (at p15 l3-3)
    (at p16 l3-0)
    (at p17 l1-0)
    (at a0 l5-0)
    (at a1 l0-0)
    (at a2 l3-0)
)
(:goal
    (and
        (at p0 l1-3)
        (at p1 l3-1)
        (at p2 l4-2)
        (at p3 l0-3)
        (at p4 l2-0)
        (at p5 l5-1)
        (at p6 l5-1)
        (at p7 l3-1)
        (at p8 l2-2)
        (at p9 l4-2)
        (at p10 l5-3)
        (at p11 l2-2)
        (at p12 l2-3)
        (at p13 l1-1)
        (at p14 l5-0)
        (at p15 l5-0)
        (at p16 l3-3)
        (at p17 l2-0)
    )
)
)

; plan
1. (load-truck p2 t5 l5-1)
   deleted: (at p2 l5-1)
   added: (in p2 t5)
   goals met: 0 of 18
2. (load-truck p11 t4 l4-2)
   deleted: (at p11 l4-2)
   added: (in p11 t4)
   goals met: 0 of 18
3. (drive-truck t4 l4-2 l4-0 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-0)
   goals met: 0 of 18
4. (load-truck p9 t4 l4-0)
   deleted: (at p9 l4-0)
   added: (in p9 t4)
   goals met: 0 of 18
5. (unload-truck p11 t4 l4-0)
   deleted: (in p11 t4)
   added: (at p11 l4-0)
   goals met: 0 of 18
6. (fly-airplane a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 0 of 18
7. (load-airplane p17 a2 l1-0)
   deleted: (at p17 l1-0)
   added: (in p17 a2)
   goals met: 0 of 18
8. (load-airplane p7 a1 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 a1)
   goals met: 0 of 18
9. (fly-airplane a0 l5-0 l4-0)
   deleted: (at a0 l5-0)
   added: (at a0 l4-0)
   goals met: 0 of 18
10. (load-airplane p11 a0 l4-0)
   deleted: (at p11 l4-0)
   added: (in p11 a0)
   goals met: 0 of 18
11. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 0 of 18
12. (load-truck p6 t5 l5-0)
   deleted: (at p6 l5-0)
   added: (in p6 t5)
   goals met: 0 of 18
13. (unload-truck p2 t5 l5-0)
   deleted: (in p2 t5)
   added: (at p2 l5-0)
   goals met: 0 of 18
14. (drive-truck t5 l5-0 l5-1 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 0 of 18
15. (unload-truck p6 t5 l5-1)
   deleted: (in p6 t5)
   added: (at p6 l5-1)
   goals met: 1 of 18
16. (drive-truck t5 l5-1 l5-3 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-3)
   goals met: 1 of 18
17. (load-truck p1 t5 l5-3)
   deleted: (at p1 l5-3)
   added: (in p1 t5)
   goals met: 1 of 18
18. (load-truck p0 t5 l5-3)
   deleted: (at p0 l5-3)
   added: (in p0 t5)
   goals met: 1 of 18
19. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 1 of 18
20. (unload-truck p9 t4 l4-2)
   deleted: (in p9 t4)
   added: (at p9 l4-2)
   goals met: 2 of 18
21. (drive-truck t4 l4-2 l4-3 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-3)
   goals met: 2 of 18
22. (load-truck p10 t4 l4-3)
   deleted: (at p10 l4-3)
   added: (in p10 t4)
   goals met: 2 of 18
23. (drive-truck t4 l4-3 l4-0 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-0)
   goals met: 2 of 18
24. (unload-truck p10 t4 l4-0)
   deleted: (in p10 t4)
   added: (at p10 l4-0)
   goals met: 2 of 18
25. (load-airplane p10 a0 l4-0)
   deleted: (at p10 l4-0)
   added: (in p10 a0)
   goals met: 2 of 18
26. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 2 of 18
27. (load-truck p16 t3 l3-0)
   deleted: (at p16 l3-0)
   added: (in p16 t3)
   goals met: 2 of 18
28. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 2 of 18
29. (unload-truck p16 t3 l3-3)
   deleted: (in p16 t3)
   added: (at p16 l3-3)
   goals met: 3 of 18
30. (load-truck p15 t3 l3-3)
   deleted: (at p15 l3-3)
   added: (in p15 t3)
   goals met: 3 of 18
31. (load-truck p12 t3 l3-3)
   deleted: (at p12 l3-3)
   added: (in p12 t3)
   goals met: 3 of 18
32. (drive-truck t3 l3-3 l3-1 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-1)
   goals met: 3 of 18
33. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 3 of 18
34. (load-truck p4 t2 l2-1)
   deleted: (at p4 l2-1)
   added: (in p4 t2)
   goals met: 3 of 18
35. (load-truck p14 t2 l2-1)
   deleted: (at p14 l2-1)
   added: (in p14 t2)
   goals met: 3 of 18
36. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 3 of 18
37. (unload-truck p4 t2 l2-0)
   deleted: (in p4 t2)
   added: (at p4 l2-0)
   goals met: 4 of 18
38. (unload-truck p14 t2 l2-0)
   deleted: (in p14 t2)
   added: (at p14 l2-0)
   goals met: 4 of 18
39. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 4 of 18
40. (load-truck p8 t1 l1-1)
   deleted: (at p8 l1-1)
   added: (in p8 t1)
   goals met: 4 of 18
41. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 4 of 18
42. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 4 of 18
43. (load-airplane p8 a2 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a2)
   goals met: 4 of 18
44. (drive-truck t0 l0-3 l0-1 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 4 of 18
45. (load-truck p3 t0 l0-1)
   deleted: (at p3 l0-1)
   added: (in p3 t0)
   goals met: 4 of 18
46. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 4 of 18
47. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 4 of 18
48. (load-truck p5 t0 l0-2)
   deleted: (at p5 l0-2)
   added: (in p5 t0)
   goals met: 4 of 18
49. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 4 of 18
50. (unload-truck p5 t0 l0-0)
   deleted: (in p5 t0)
   added: (at p5 l0-0)
   goals met: 4 of 18
51. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 4 of 18
52. (unload-truck p3 t0 l0-3)
   deleted: (in p3 t0)
   added: (at p3 l0-3)
   goals met: 5 of 18
53. (load-airplane p5 a1 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a1)
   goals met: 5 of 18
54. (fly-airplane a2 l1-0 l3-0)
   deleted: (at a2 l1-0)
   added: (at a2 l3-0)
   goals met: 5 of 18
55. (load-airplane p13 a2 l3-0)
   deleted: (at p13 l3-0)
   added: (in p13 a2)
   goals met: 5 of 18
56. (fly-airplane a1 l0-0 l3-0)
   deleted: (at a1 l0-0)
   added: (at a1 l3-0)
   goals met: 5 of 18
57. (unload-airplane p7 a1 l3-0)
   deleted: (in p7 a1)
   added: (at p7 l3-0)
   goals met: 5 of 18
58. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 5 of 18
59. (load-truck p7 t3 l3-0)
   deleted: (at p7 l3-0)
   added: (in p7 t3)
   goals met: 5 of 18
60. (unload-truck p15 t3 l3-0)
   deleted: (in p15 t3)
   added: (at p15 l3-0)
   goals met: 5 of 18
61. (unload-truck p12 t3 l3-0)
   deleted: (in p12 t3)
   added: (at p12 l3-0)
   goals met: 5 of 18
62. (load-airplane p15 a2 l3-0)
   deleted: (at p15 l3-0)
   added: (in p15 a2)
   goals met: 5 of 18
63. (load-airplane p12 a2 l3-0)
   deleted: (at p12 l3-0)
   added: (in p12 a2)
   goals met: 5 of 18
64. (fly-airplane a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 5 of 18
65. (unload-airplane p13 a2 l1-0)
   deleted: (in p13 a2)
   added: (at p13 l1-0)
   goals met: 5 of 18
66. (load-truck p13 t1 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 t1)
   goals met: 5 of 18
67. (drive-truck t5 l5-3 l5-0 c5)
   deleted: (at t5 l5-3)
   added: (at t5 l5-0)
   goals met: 5 of 18
68. (unload-truck p1 t5 l5-0)
   deleted: (in p1 t5)
   added: (at p1 l5-0)
   goals met: 5 of 18
69. (unload-truck p0 t5 l5-0)
   deleted: (in p0 t5)
   added: (at p0 l5-0)
   goals met: 5 of 18
70. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 5 of 18
71. (unload-truck p7 t3 l3-1)
   deleted: (in p7 t3)
   added: (at p7 l3-1)
   goals met: 6 of 18
72. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 6 of 18
73. (unload-truck p13 t1 l1-1)
   deleted: (in p13 t1)
   added: (at p13 l1-1)
   goals met: 7 of 18
74. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 7 of 18
75. (fly-airplane a2 l1-0 l2-0)
   deleted: (at a2 l1-0)
   added: (at a2 l2-0)
   goals met: 7 of 18
76. (unload-airplane p8 a2 l2-0)
   deleted: (in p8 a2)
   added: (at p8 l2-0)
   goals met: 7 of 18
77. (load-truck p8 t2 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 t2)
   goals met: 7 of 18
78. (unload-airplane p17 a2 l2-0)
   deleted: (in p17 a2)
   added: (at p17 l2-0)
   goals met: 8 of 18
79. (load-airplane p14 a2 l2-0)
   deleted: (at p14 l2-0)
   added: (in p14 a2)
   goals met: 8 of 18
80. (unload-airplane p12 a2 l2-0)
   deleted: (in p12 a2)
   added: (at p12 l2-0)
   goals met: 8 of 18
81. (load-truck p12 t2 l2-0)
   deleted: (at p12 l2-0)
   added: (in p12 t2)
   goals met: 8 of 18
82. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 8 of 18
83. (unload-truck p8 t2 l2-2)
   deleted: (in p8 t2)
   added: (at p8 l2-2)
   goals met: 9 of 18
84. (drive-truck t2 l2-2 l2-3 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-3)
   goals met: 9 of 18
85. (unload-truck p12 t2 l2-3)
   deleted: (in p12 t2)
   added: (at p12 l2-3)
   goals met: 10 of 18
86. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 10 of 18
87. (fly-airplane a0 l4-0 l2-0)
   deleted: (at a0 l4-0)
   added: (at a0 l2-0)
   goals met: 10 of 18
88. (unload-airplane p11 a0 l2-0)
   deleted: (in p11 a0)
   added: (at p11 l2-0)
   goals met: 10 of 18
89. (load-truck p11 t2 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 t2)
   goals met: 10 of 18
90. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 10 of 18
91. (unload-truck p11 t2 l2-2)
   deleted: (in p11 t2)
   added: (at p11 l2-2)
   goals met: 11 of 18
92. (fly-airplane a2 l2-0 l5-0)
   deleted: (at a2 l2-0)
   added: (at a2 l5-0)
   goals met: 11 of 18
93. (load-airplane p2 a2 l5-0)
   deleted: (at p2 l5-0)
   added: (in p2 a2)
   goals met: 11 of 18
94. (fly-airplane a2 l5-0 l1-0)
   deleted: (at a2 l5-0)
   added: (at a2 l1-0)
   goals met: 11 of 18
95. (fly-airplane a2 l1-0 l4-0)
   deleted: (at a2 l1-0)
   added: (at a2 l4-0)
   goals met: 11 of 18
96. (unload-airplane p2 a2 l4-0)
   deleted: (in p2 a2)
   added: (at p2 l4-0)
   goals met: 11 of 18
97. (load-truck p2 t4 l4-0)
   deleted: (at p2 l4-0)
   added: (in p2 t4)
   goals met: 11 of 18
98. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 11 of 18
99. (unload-truck p2 t4 l4-2)
   deleted: (in p2 t4)
   added: (at p2 l4-2)
   goals met: 12 of 18
100. (fly-airplane a2 l4-0 l5-0)
   deleted: (at a2 l4-0)
   added: (at a2 l5-0)
   goals met: 12 of 18
101. (unload-airplane p15 a2 l5-0)
   deleted: (in p15 a2)
   added: (at p15 l5-0)
   goals met: 13 of 18
102. (unload-airplane p14 a2 l5-0)
   deleted: (in p14 a2)
   added: (at p14 l5-0)
   goals met: 14 of 18
103. (fly-airplane a2 l5-0 l1-0)
   deleted: (at a2 l5-0)
   added: (at a2 l1-0)
   goals met: 14 of 18
104. (fly-airplane a1 l3-0 l5-0)
   deleted: (at a1 l3-0)
   added: (at a1 l5-0)
   goals met: 14 of 18
105. (unload-airplane p5 a1 l5-0)
   deleted: (in p5 a1)
   added: (at p5 l5-0)
   goals met: 14 of 18
106. (load-truck p5 t5 l5-0)
   deleted: (at p5 l5-0)
   added: (in p5 t5)
   goals met: 14 of 18
107. (load-airplane p1 a1 l5-0)
   deleted: (at p1 l5-0)
   added: (in p1 a1)
   goals met: 14 of 18
108. (fly-airplane a1 l5-0 l3-0)
   deleted: (at a1 l5-0)
   added: (at a1 l3-0)
   goals met: 14 of 18
109. (unload-airplane p1 a1 l3-0)
   deleted: (in p1 a1)
   added: (at p1 l3-0)
   goals met: 14 of 18
110. (fly-airplane a0 l2-0 l5-0)
   deleted: (at a0 l2-0)
   added: (at a0 l5-0)
   goals met: 14 of 18
111. (unload-airplane p10 a0 l5-0)
   deleted: (in p10 a0)
   added: (at p10 l5-0)
   goals met: 14 of 18
112. (load-truck p10 t5 l5-0)
   deleted: (at p10 l5-0)
   added: (in p10 t5)
   goals met: 14 of 18
113. (drive-truck t5 l5-0 l5-1 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 14 of 18
114. (unload-truck p5 t5 l5-1)
   deleted: (in p5 t5)
   added: (at p5 l5-1)
   goals met: 15 of 18
115. (drive-truck t5 l5-1 l5-3 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-3)
   goals met: 15 of 18
116. (unload-truck p10 t5 l5-3)
   deleted: (in p10 t5)
   added: (at p10 l5-3)
   goals met: 16 of 18
117. (load-airplane p0 a0 l5-0)
   deleted: (at p0 l5-0)
   added: (in p0 a0)
   goals met: 16 of 18
118. (fly-airplane a0 l5-0 l1-0)
   deleted: (at a0 l5-0)
   added: (at a0 l1-0)
   goals met: 16 of 18
119. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 16 of 18
120. (load-truck p0 t1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 16 of 18
121. (drive-truck t1 l1-0 l1-3 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-3)
   goals met: 16 of 18
122. (unload-truck p0 t1 l1-3)
   deleted: (in p0 t1)
   added: (at p0 l1-3)
   goals met: 17 of 18
123. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 17 of 18
124. (load-truck p1 t3 l3-0)
   deleted: (at p1 l3-0)
   added: (in p1 t3)
   goals met: 17 of 18
125. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 17 of 18
126. (unload-truck p1 t3 l3-1)
   deleted: (in p1 t3)
   added: (at p1 l3-1)
   goals met: 18 of 18
